/* --------------------------------------------------------------------- */
/* Code Structure                                                        */
/* --------------------------------------------------------------------- */

// 한 줄 주석 (single line comment)
console.log('ECMAScript의 `문`은 어떠한 작업을 수행하는 문법 구조 및 명령을 의미합니다.');

// 세미콜론 (semicolons)
console.log('다음 줄에서 코드를 작성 할 경우, 세미콜론을 붙인 것과 동일합니다.');
console.log('하지만 세미콜론을 명시적으로 추가할 것을 권장합니다.');

/* 
  여러 줄 (multi lines)
  주석 (comment) 
*/

/* --------------------------------------------------------------------- */
/* Variables                                                             */
/* --------------------------------------------------------------------- */

/* 다음 내용을 분석한 후, 프로그래밍 할 수 있도록 변수와 상수를 작성해봅니다. ----------- */

// - 갯수 별 상품 가격 계산하기
// - 구매 제품 가격의 총 합
// - 1년 기준 일(day)자 수
// - 구매 결제 여부
// - 구매 결제 내역
// - 브랜드 접두사
// - 오늘의 운세
// - 상품 정보

/* variables ----------------------------------------------------------- */

/* constant variables -------------------------------------------------- */
